Documents/УправлениеУслугамиПодробно.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>УправлениеУслугамиПодробно</Name>
			<BasedOn>
				<xr:Item>Catalog.ЛицевыеСчета</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.НазначенныеУслугиПодробно</xr:Item>
				<xr:Item>InformationRegister.НазначенныеУслуги</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийУправленияУслугами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЛицевыеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УслугиПодробно</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УслугаПодробно</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УслугиСДПТПодробно</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВидыОперацийУправленияУслугами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыОперацийУправленияУслугами</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НазначениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтключениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриостановкаУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВременноеНазначениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеКачестваУслуг</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/УправлениеУслугамиПодробно/Forms/ФормаДокумента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Функция получает список лицевых счетов из временного хранилища
//
&НаСервере
Процедура ПолучитьЛицевыеСчетаИзХранилища(АдресЛицевыхСчетовВХранилище)
	
	ТаблицаДляЗагрузки	= ПолучитьИзВременногоХранилища(АдресЛицевыхСчетовВХранилище);
	
	Объект.ЛицевыеСчета.Загрузить(ТаблицаДляЗагрузки);
	
КонецПроцедуры // ПолучитьЛицевыеСчетаИзХранилища()

// Процедура устанавливает видимость и доступность элементов формы.
//
// Параметры:
//  Нет.
//
&НаСервере
Процедура УстановитьВидимостьИДоступность()
	
	Если ЛицевыеСчетаСписком Тогда
		Элементы.ЛицевыеСчета.Видимость = Истина;
		Элементы.ЛицевойСчет.Видимость = Ложь;
	Иначе
		Элементы.ЛицевыеСчета.Видимость = Ложь;	
		Элементы.ЛицевойСчет.Видимость = Истина;
	КонецЕсли;
	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийУправленияУслугами.ПриостановкаУслуги Тогда
		Элементы.ГруппаПриостановка.Видимость = Истина;
		Элементы.ГруппаНазначение.Видимость = Ложь;
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийУправленияУслугами.НазначениеУслуги Тогда
		Элементы.ГруппаНазначение.Видимость = Истина;
		Элементы.ГруппаПриостановка.Видимость = Ложь;
		Элементы.ДатаНачала.Видимость = Истина;
		Элементы.ДатаОкончания.Видимость = Ложь;
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийУправленияУслугами.ОтключениеУслуги Тогда
		Элементы.ГруппаНазначение.Видимость = Истина;
		Элементы.ГруппаПриостановка.Видимость = Ложь;
		Элементы.ДатаНачала.Видимость = Ложь;
		Элементы.ДатаОкончания.Видимость = Истина;
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийУправленияУслугами.ВременноеНазначениеУслуги Тогда
		Элементы.ГруппаНазначение.Видимость = Истина;
		Элементы.ГруппаПриостановка.Видимость = Ложь;
		Элементы.ДатаНачала.Видимость = Истина;
		Элементы.ДатаОкончания.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры // УстановитьВидимостьИДоступность()

// Процедура - обработчик события ПриИзменении поля ввода "ЛицевойСчет".
//
&НаКлиенте
Процедура ЛицевойСчетПриИзменении(Элемент)
	
	Объект.ЛицевыеСчета[0].ЛицевойСчет = ЛицевойСчет;	
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода "ЛицевыеСчетаСписком".
//
&НаКлиенте
Процедура ЛицевыеСчетаСпискомПриИзменении(Элемент)
	
	УстановитьВидимостьИДоступность();

КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода "ВидОперации".
//
&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	УстановитьВидимостьИДоступность();
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода "Здание".
//
&НаКлиенте
Процедура ЗданияПриИзменении(Элемент)
	
	Если Объект.ЛицевыеСчета.Количество() > 0 Тогда
		ЛицевойСчет = Объект.ЛицевыеСчета[0].ЛицевойСчет;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик команды "Подбор".
//
&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыЗаполнения = Новый Структура;
	
	ПараметрыЗаполнения.Вставить("ДатаНачала",		НачалоМесяца(Объект.Дата));
	ПараметрыЗаполнения.Вставить("ДатаОкончания",	КонецМесяца(Объект.Дата));
	ПараметрыЗаполнения.Вставить("ОтборОрганизация",	Объект.Организация);
	ПараметрыЗаполнения.Вставить("ОтборЗдание",			Объект.Здание);
	
	АдресЛицевыхСчетовВХранилище = ОткрытьФормуМодально("ОбщаяФорма.ФормаПодбораЛицевыхСчетов", ПараметрыЗаполнения);
	
	Если ЗначениеЗаполнено(АдресЛицевыхСчетовВХранилище) Тогда
		
		Объект.ЛицевыеСчета.Очистить();
		
		ПолучитьЛицевыеСчетаИзХранилища(АдресЛицевыхСчетовВХранилище);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события НачалоВыбора поля ввода "ЛицевойСчет".
//
&НаКлиенте
Процедура ЛицевойСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыВыбораЗначения = Новый Структура;
	ПараметрыВыбораЗначения.Вставить("ОтборОрганизация",	Объект.Организация);
	ПараметрыВыбораЗначения.Вставить("ОтборЗдание",			Объект.Здание);

	ОткрытьФорму("Справочник.ЛицевыеСчета.Форма.ФормаВыбораСОтбором", ПараметрыВыбораЗначения, Элемент);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события ПриСозданииНаСервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОСМДСервер.ЗаполнитьШапкуДокумента(
		Объект,
		,
		Параметры.ЗначениеКопирования,
		Параметры.Основание,
		СостояниеДокумента,
		КартинкаСостоянияДокумента,
		РазрешеноПроведение,
		ПоследнееИзменение,
		Параметры.ЗначенияЗаполнения);
	
	Если Параметры.Основание = Неопределено Тогда
		ЛицевыеСчетаСписком = Истина;
	Иначе
		ЛицевыеСчетаСписком = Ложь;
	КонецЕсли;
	
	Если Объект.ЛицевыеСчета.Количество() > 0 Тогда
		ЛицевойСчет = Объект.ЛицевыеСчета[0].ЛицевойСчет;
	КонецЕсли;
	
	УстановитьВидимостьИДоступность();
	
	// ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ДополнительныеОтчетыИОбработки
	
	Локализация.ПриСозданииНаСервере(ЭтаФорма, Объект.Ссылка);
	
КонецПроцедуры

// Процедура - обработчик события ПослеЗаписи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОСМДКлиент.ОбновитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента, РазрешеноПроведение, ПоследнееИзменение);
	
КонецПроцедуры
